Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །དེ་ལྟར་བྱིས་པ་དེ་དག་ཡི་གེའི་ཕྱི་མོ་སློབ་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་མཐུས་དེ་དག་ལ་སོགས་པ་ཆོས་ཀྱི་སྒོ་བརྒྱ་སྟོང་གྲངས་མེད་པ་བྱུང་བར་གྱུར་ཏེ།
en: Thus, while the schoolmaster taught the children the alphabet, there emerged innumerable hundreds of thousands of excellent Dharma teachings due to the Bodhisattva’s power.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡི་གེའི་གྲྭ་ན་འདུག་པའི་ཚེ་བྱིས་པ་སུམ་ཁྲི་ཉིས་སྟོང་རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ།
en: Moreover, while the Bodhisattva was attending school, 32,000 children gave rise to thoughts aimed at unexcelled, perfect, and complete awakening.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལོབས་པར་གྱུར་ཀྱང་ཡི་གེའི་གྲྭར་འཇུག་པའི་རྒྱུ་ནི་དེ་ཡིན་ནོ། །རྐྱེན་ནི་དེ་ཡིན་ནོ།
en: This is the circumstance and the reason why the Bodhisattva attended school, even though he was already so learned.

source: །ཡི་གེ་བསྟན་པའི་ལེའུ་སྟེ་བཅུ་པའོ།། །།
en: This concludes the tenth chapter, on the demonstration at the writing school.

source: དགེ་སློང་དག་གཞོན་ནུ་དེ་དེ་བས་ཀྱང་ཡ་ཟད་སྐྱེས་ནས་དུས་གཞན་ཞིག་ན་གཞོན་ནུ་དེ་གཞོན་ནུ་གཞན་དག་དང་ཞང་བློན་གྱི་བུ་དག་དང་ལྷན་ཅིག་ཏུ་ཞིང་པའི་གྲོང་ལྟ་ཞིང་དོང་སྟེ།
en: Monks, on another occasion when the prince had grown a little older, he went with the sons of the ministers and some other boys to visit a farming village.

source: གྲོང་བལྟས་ནས་ཞིང་བླས་ཀྱི་མཐའི་སྐྱེད་མོས་ཚལ་ཞིག་ཏུ་ཕྱིན་ཏོ།
en: After seeing the village, he entered a park at the edge of the fields.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་པུ་གཉིས་སུ་མེད་པར་ཕ་ཟད་འཁྱམ་ཞིང་སོང་སོང་བ་དང་། འཛམ་བུའི་ཤིང་ལྗོན་པ་མཛེས་པ་བལྟ་ན་སྡུག་པ་ཞིག་མཐོང་ནས། བྱང་ཆུབ་སེམས་དཔའ་དེའི་གྲིབ་མ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་གོ།
en: The Bodhisattva wandered around there in complete solitude. As he was strolling through the park, he saw a beautiful and pleasant rose apple tree, and he decided to sit down cross-legged under its shade.

source: །འདུག་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་རྩེ་གཅིག་པ་རྙེད་དེ་རྙེད་ནས་ཀྱང་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་བསྒྲུབས་ཏེ་གནས་སོ།
en: Seated there, the Bodhisattva attained a one-pointed state of mind. He then settled into the first meditative concentration, which is free of factors connected with evil deeds and nonvirtues. It is accompanied by thought and analysis and is imbued with the joy and pleasure born of discernment.

source: །དེ་རྟོག་པ་དང་དཔྱོད་པ་དང་བྲལ་ཞིང་ནང་ཡོངས་སུ་དང་སྟེ།
en: He then brought about the cessation of thoughts and analysis and became perfectly quiet.

source: སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་བསྒྲུབས་ཏེ་གནས་སོ།
en: As his mind became concentrated, he settled into the second meditative concentration, which is free of thought and analysis and is imbued with the joy and pleasure born of meditative absorption.

source: །དེ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་དྲན་པ་དང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: Without any attachment to joy, he remained in equanimity with mindfulness and introspection and experienced physical pleasure. Aware and cognizant, he felt physically at ease.

source: འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དྲན་པ་དང་ལྡན་པ། བདེ་བ་ལ་གནས་པ་བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ། དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་བསྒྲུབས་ཏེ་གནས་སོ། །
en: He had settled into the third meditative concentration, which is without joy: “impartial, aware, and abiding at ease,” as the noble ones describe it.

source: དེ་བདེ་བ་ཡང་སྤངས་ཏེ་སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་བསྒྲུབས་ཏེ་གནས་སོ། །
en: He had already relinquished suffering and, as he now abandoned the feeling of comfort, both mental pleasure and displeasure vanished. Thus he settled into the fourth meditative concentration: perfectly pristine with impartiality and mindfulness, unconnected with pleasure or pain.

source: དེའི་ཚེ་ཕྱི་རོལ་གྱི་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་ཡོད་པ་རྫུ་འཕྲུལ་དང་ལྡན་པ་ནམ་མཁའ་ལས་དོང་བ་ལྔ་ཞིག་ལྷོ་ཕྱོགས་ནས་བྱང་ཕྱོགས་ལོགས་སུ་དོང་དོང་བ་ལས་དེ་དག་ཚལ་སྟུག་པོ་དེའི་སྟེང་དུ་ཕྱིན་པ་དང་། ཕྱིར་ཕུལ་བ་ལྟར་འདོང་མ་ནུས་ནས།
en: Right then five extremist sages, who had miraculous powers and the five superknowledges, were flying through the sky toward the north. Yet as they flew above this grove, they suddenly could not go any farther, and it felt as if they were being pushed back.

source: དེ་དག་མི་དགའ་ཞིང་བ་སྤུ་གཡོས་ཏེ། ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: With the hairs on their bodies bristling with anger, they spoke the following verse:

source: །བདག་ཅག་འདི་ན་རི་རབ་ནོར་བུ་རྡོ་རྗེ་བརྩེགས་རི་ཤིན་ཏུ་རྔམས་སྟུག་པ་ཡང་ཐལ་ཕྱུང་སྟེ། །གླང་པོ་ཨ་མྲའི་ཤིང་རློན་ཡལ་གས་གཟིངས་པ་མང་པོ་བཅོམ་ནས་འགྲོ་བཞིན་དོང་དོང་ལ།
en: “Like an elephant tearing apart a fresh grove of mango trees, We proceed and reduce to ashes even the enormous diamond peak of Mount Meru.

source: །བདག་ཅག་འདི་ན་ལྷ་ཡི་ཁྱིམ་ནའང་ཐོགས་མེད་གནོད་སྦྱིན་དྲི་ཟའི་ཁྱིམ་སྟེང་ནམ་མཁར་གནས་གནས་ན།
en: Even among gods we go unhindered, high above the realm of yakṣas and gandharvas, Yet here at this grove, we are weak.

source: །ཚལ་སྟུག་འདིར་ཕྱིན་ནས་ནི་སྒྱིད་ལུག་གྱུར་པ་སུ་ཡི་མཐུ་ཞིག་གིས་ན་རྫུ་འཕྲུལ་སྟོབས་བཟློག་གྱུར།
en: Whose force dissolves our magical powers?”

source: །དེ་ནས་ཚལ་སྟུག་པོ་དེ་ན་ལྷ་མོ་ཞིག་གནས་པ་དེས་དྲང་སྲོང་དེ་དག་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Dwelling in that grove was a goddess, who sang this verse to the sages:

source: རྒྱལ་པོའི་གཙོ་བོའི་རིགས་བྱུང་ཤཱཀྱའི་རྒྱལ་སྲས་ཉི་མ་ཤར་བ་ལྟ་བུར་རབ་ཏུ་སྣང་བའི་འོད།
en: “It is the Śākya prince, descendant of the best of kings, who shines like the dawn;

source: །འཇིག་རྟེན་གཙོ་བོ་མཁས་པ་ཟླ་ཞལ་པད་མ་རྒྱས་པའི་སྙིང་པོའི་ཁ་དོག་ལྟ་བུར་རབ་མཛེས་པ།
en: This wise, supreme man has a moon-like face with the beauty of a blooming lotus.

source: །ལྷ་དང་ཀླུ་དབང་གནོད་སྦྱིན་དྲི་ཟས་མཆོད་པ་དེ་ནི་བསམ་གཏན་དགོངས་ཤིང་ཚལ་སྟུག་འདི་ན་བཞུགས།
en: He, whom gods, nāga kings, gandharvas, and yakṣas revere, is in the park, concentrating;

source: །སྲིད་པ་བྱེ་བ་བརྒྱ་དག་ཏུ་ནི་བསོད་ནམས་སྤེལ་བ་དེ་ཡི་མཐུ་ཡིས་རྫུ་འཕྲུལ་སྟོབས་བཟློག་གོ།
en: His power, gained from merit in millions of lives, is thwarting your miracles.”

source: །དེ་ནས་དེ་དག་གིས་འོག་ལོགས་སུ་བལྟས་པ་དང་། །གཞོན་ནུ་ཞིག་དཔལ་དང་གཟི་བརྗིད་ཀྱིས་འབར་བ་མཐོང་ནས་འདི་དག་འདི་སྙམ་དུ་སུ་ཞིག་འདི་ལྟར་གནས།
en: When the sages looked down below, they saw a child blazing with glory and splendor, and they thought, “Who is this seated here?

source: ནོར་གྱི་བདག་པོ་རྣམ་ཐོས་ཀྱི་བུའམ་ཅིག་མ་ཡིན་ནམ།
en: Could it be Vaiśravaṇa, lord of wealth?

source: འོན་ཏེ་འདོད་པའི་དབང་པོ་བདུད་ལྟའམ། ཡང་ན་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའམ།
en: Or is it Māra, lord of sense pleasures, or perhaps the lord of the mahoragas?

source: འོན་ཏེ་དབང་པོ་རྡོ་རྗེ་འཆང་བའམ།
en: Could it be Śakra, the vajra holder?

source: ཡང་ན་གུ་ལང་ངམ། གྲུལ་བུམ་གྱི་བདག་པོའམ།
en: Or is it perhaps Rudra, or the lord of kumbhāṇḍas?

source: འོན་ཏེ་སྤྲོ་བ་ཆེན་པོ་དང་ལྡན་པ་ནག་པོའམ། འོན་ཏེ་ལྷའི་བུ་ཟླ་བའམ། འོན་ཏེ་འོད་ཟེར་སྟོང་དང་ལྡན་པའི་ཉི་མའམ།
en: Could it be the mighty Kṛṣṇa, or perhaps the divine moon, or the thousand-rayed sun?

source: འོན་ཏེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཞིག་ཡིན་ནམ། སུ་ཞིག་སྙམ་མོ། །དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་ཡང་སྨྲས་སོ།
en: Or will it turn out to be a universal monarch?” Then they spoke the following verse:

source: །གཞོན་ནུ་འདི་ནི་རྣམ་ཐོས་བུ་ཡི་གཟུགས་ལས་འཕགས་པར་གསལ་བར་སྣང་བས་ན།
en: “This youth appears far more beautiful than Vaiśravaṇa.

source: །འདི་ནི་སྒྲ་གཅན་ཡིན་ནམ་འོན་ཏེ་རྡོ་རྗེ་འཆང་གི་གཟུགས་སམ་ཉི་ཟླའི་གཟུགས།
en: So is he Rāhu, an image of the vajra holder, the sun, or the moon?

source: །འདོད་མཆོག་དབང་པོའི་གཟུགས་སམ་གུ་ལང་གཟུགས་སམ་འོན་ཏེ་ནག་པོའི་གཟུགས་ཡིན་ནམ།
en: Or maybe he is an image of the supreme lord of sense pleasures, or Rudra, or Kṛṣṇa?

source: །ཡང་ན་འདི་ནི་དཔལ་ལྡན་ཡན་ལག་མཚན་སྤྲས་སྡིག་མེད་སངས་རྒྱས་འགྱུར་བ་ཞིག །དེ་ནས་ཚལ་གྱི་ལྷ་མོ་དེས་དྲང་སྲོང་དེ་དག་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Or perhaps he is a perfect Buddha, adorned with glorious physical signs?” Then the goddess of the grove addressed the sages with the following verse:

source: རྣམ་ཐོས་བུ་དང་མིག་སྟོང་བདོག་ལ་དཔལ་ནི་གང་ཡོད་གྱུར་པ་དང་། །འཇིག་རྟེན་སྐྱོང་བ་བཞི་དང་ལྷ་མིན་དབང་ལ་དཔལ་ནི་གང་ཡོད་དང་། །མི་མཇེད་བདག་པོ་ཚངས་དང་གཟའ་རྣམས་ལ་ཡང་དཔལ་ནི་གང་ཡོད་པ།
en: “All the splendor of Vaiśravaṇa and the thousand-eyed one, All the splendor of the four guardians of the world and the lord of the demigods, All the splendor of Brahmā, lord of the world, and Kṛṣṇa,

source: །དཔལ་དེ་ཤཱཀྱའི་སྲས་པོ་འདི་དྲུང་ཕྱིན་ན་གང་གི་ཆར་མི་ཕོད།
en: Is minuscule in comparison to that of the son of the Śākyas.”

source: །དེ་ནས་དྲང་སྲོང་དེ་དག་གིས་ལྷ་མོ་དེའི་ཚིག་ཐོས་ནས་ས་ལ་བབས་པ་དང་། དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་མི་གཡོ་བའི་ལུས་ཀྱིས་བསམ་གཏན་བྱེད་ཅིང་། མེའི་ཕུང་པོ་ལྟར་འབར་བ་མཐོང་ནས།
en: Once the sages heard the goddess’s words, they descended to the ground. There they saw the Bodhisattva practicing concentration, his body immovable and blazing with a mass of light.

source: དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ་སེམས་ཤིང་ཚིགས་སུ་བཅད་པས་བསྟོད་དེ།
en: Reflecting on the Bodhisattva, they praised him with verses.

source: དེ་ལ་གཅིག་གིས་སྨྲས་པ།
en: One of the sages said:

source: འཇིག་རྟེན་ཉོན་མོངས་མེས་གདུངས་པ།
en: “In a world tormented by the fire of afflictions,

source: །མཚོ་འདི་རབ་ཏུ་བྱུང་གྱུར་ཏེ། །
en: This lake has appeared.

source: གང་གིས་འཇིག་རྟེན་སིམ་འགྱུར་བའི། །ཆོས་དེ་འདི་ཡིས་བརྙེས་པར་འགྱུར།
en: He will discover the Dharma That will soothe beings.”

source: །ཡང་གཅིག་གིས་སྨྲས་པ།
en: Another sage said:

source: མི་ཤེས་རབ་རིབ་འཇིག་རྟེན་དུ།
en: “In a world benighted with ignorance,

source: །སྒྲོན་མ་འདི་ནི་རབ་ཏུ་བྱུང་། །
en: This torch has appeared.

source: གང་གིས་འགྲོ་བ་སྣང་འགྱུར་བའི། །ཆོས་དེ་འདི་ཡིས་བརྙེས་པར་འགྱུར།
en: He will discover the Dharma That will illuminate beings.”

source: མྱ་ངན་རྒྱ་མཚོ་འདལ་བ་ལ།
en: “On a vast ocean of sorrow,

source: །གྲུ་ཡི་དམ་པ་འདི་བྱུང་སྟེ། །
en: This sublime vessel has appeared.

source: གང་གིས་འགྲོ་བ་སྒྲོལ་འགྱུར་བའི། །ཆོས་དེ་འདི་ཡིས་བརྙེས་པར་འགྱུར།
en: He will discover the Dharma That will ferry beings across.”

source: ཡང་གཅིག་གིས་སྨྲས་པ།
en: The fourth sage said:

source: ཉོན་མོངས་འཆིང་བས་བཅིངས་པ་ལ།
en: “To those bound by the fetters of afflictions,

source: །འགྲོལ་བར་མཛད་པ་འདི་བྱུང་སྟེ།
en: A savior has appeared.

source: །གང་གིས་འགྲོ་བ་འགྲོལ་འགྱུར་བའི། །ཆོས་དེ་འདི་ཡིས་བརྙེས་པར་འགྱུར།
en: He will discover a Dharma That will free beings.”

source: རྒ་དང་ནད་ཀྱིས་གཟིར་བ་ལ།
en: “To those afflicted with old age and sickness,

source: །སྨན་པ་དམ་པ་འདི་བྱུང་སྟེ།
en: The best of doctors has come.

source: །གང་གིས་རྒ་ཤི་ཐར་བྱ་བའི། ། ཆོས་དེ་འདི་ཡིས་བརྙེས་པར་འགྱུར།
en: He will discover a Dharma That frees from birth and death.”

source: །དེ་ནས་དྲང་སྲོང་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་བསྟོད་དེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ནམ་མཁའ་ལས་དོང་ངོ་།
en: Once the sages had praised the Bodhisattva with these verses, they circumambulated him three times and returned to the sky.

source: །རྒྱལ་པོ་ཟས་གཙང་མ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་མི་མཐོང་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་མེད་པས་མི་དགའ་སྟེ། དེས་སྨྲས་པ།
en: King Śuddhodana did not see the Bodhisattva. Displeased with his absence, he said, “Where has the child gone?

source: གཞོན་ནུ་དེ་མི་སྣང་ན་གར་སོང་།
en: I do not see him.”

source: དེའི་ཚེ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་གཞོན་ནུ་ཚོལ་དུ་དོང་དོང་བ་དང་། དེའི་ཚེ་བློན་པོ་གཅིག་ཅིག་གིས་བྱང་ཆུབ་སེམས་དཔའ་འཛམ་བུའི་ཤིང་གི་གྲིབ་མ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བསམ་གཏན་བྱེད་ཅིང་འདུག་པ་མཐོང་ངོ་།
en: A great many people ran around searching for the boy. Finally one of the ministers saw the Bodhisattva seated cross-legged, practicing concentration in the shade of a rose apple tree.

source: །དེས་དེའི་ཚེ་ཤིང་ཐམས་ཅད་ཀྱི་གྲིབ་མ་ནི་ཡོལ་ན། འཛམ་བུའི་ཤིང་གི་གྲིབ་མ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་མི་གཏོང་བར་འདུག་པར་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: Although the shade of all the trees had shifted by that time, the shade of the rose apple tree had not left the Bodhisattva’s body. Seeing him there, the minister was surprised.

source: ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ནས་རབ་ཏུ་དགའ་སྟེ། དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་རིངས་ཤིང་མྱུར་བ་མྱུར་བའི་གཟུགས་ཀྱིས།
en: Elated with a sense of satisfaction and joy, he was ecstatic.

source: རྒྱལ་པོ་ཟས་གཙང་མའི་ཐད་དུ་ཕྱིན་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: In a state of jubilation he rushed before King Śuddhodana and said the following verses:

source: །རྒྱལ་པོ་གཞོན་ནུ་དེ་ལ་གཟིགས།
en: “Your Majesty, look! This child is practicing concentration

source: །འཛམ་བུའི་ཤིང་གྲིབ་བསམ་གཏན་མཛད། །བརྒྱ་བྱིན་ཚངས་པ་ཇི་བཞིན་དུ། །གཟི་བརྗིད་དཔལ་གྱིས་རབ་ཏུ་མཛེས།
en: In the shade of the rose apple tree. He shines with glory and splendor Like Śakra or Brahmā!

source: །ཞུགས་ཤིང་གང་གི་གྲིབ་མ་ལ།
en: “The shade of the tree

source: །མཚན་རབ་མངའ་བ་དེ་བཞུགས་པའི།
en: Where this perfect being is seated

source: །གྲིབ་མ་དེས་ནི་དེ་མ་བཏང་།
en: Does not leave him.

source: །སྐྱེས་མཆོག་བསམ་གཏན་མཛད་ལ་སྒྲིབ།
en: It shades this supreme being while he practices concentration.”

source: །དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མ་འཛམ་བུའི་ཤིང་ལྗོན་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: King Śuddhodana went over to the rose apple tree.

source: བྱང་ཆུབ་སེམས་དཔའ་དཔལ་དང་གཟི་བརྗིད་ཀྱིས་འབར་བ་དེ་མཐོང་བ་དང་། ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: He saw the Bodhisattva blazing with glory and splendor and uttered this verse:

source: །རི་ཡི་སྤོ་ལ་མེ་འབར་འདྲ་བ་སྟེ།
en: “Like seeing a fire blazing on a mountain peak,

source: །ཟླ་བ་སྐར་མའི་ཚོགས་ནང་འདུག་འདྲ་ཞིང་།
en: Or the moon present amid a cluster of stars,

source: །གཟི་བརྗིད་སྒྲོན་འདྲ་བསམ་གཏན་བྱེད་མཐོང་ན།
en: When I see him meditating with a torch-like luster,

source: །ང་ཡི་ལུས་འདི་ཤིན་ཏུ་འདར་བར་གྱུར། །
en: My limbs tremble.”

source: དེ་སྐད་ཅེས་སྨྲས་ནས། དེས་བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་ལ་ཕྱག་བྱས་ཏེ། ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: He bowed to the feet of the Bodhisattva and spoke to him in verse:

source: །ཐུབ་པ་གང་ཚེ་བལྟམ་པ་དང་། །གང་ཚེ་འོད་ལྡན་བསམ་གཏན་མཛད། །འདྲེན་པ་འདི་ལྟར་ལན་གཉིས་སུ། །མགོན་པོ་ཁྱོད་ཞབས་ཕྱག་འཚལ་ལོ།
en: “I have now twice bowed down to your feet, O Leader and Lord— Once when you were born, And now as you practice concentration, shining.”

source: །དེའི་ཚེ་བྱིས་པ་ཁྲེའུ་ཐོགས་པ་དག་ཅ་ཅོའི་སྒྲ་འབྱིན་པར་གྱུར་ནས།
en: At that point some of the other boys, who were carrying their seats, made a commotion.

source: དེ་དག་ལ་བློན་པོ་དག་གིས་སྒྲ་མ་ཆེ་སྒྲ་མ་ཆེ་ཞེས་བྱས་པ་དང་། དེ་དག་ཅི་ཞིག་ནོངས་ཞེས་ཟེར་རོ།
en: The ministers thus told them, “Quiet down! Quiet down!” “Why?” asked the boys.

source: །བློན་པོ་དག་གིས་སྨྲས་པ། རྒྱལ་པོའི་སྲས་དོན་ཐམས་ཅད་གྲུབ་པ་དགེ་བའི་མཚན་བཟང་པོ་མཆོག་དམ་པ་དང་ལྡན་ཞིང་འོད་འདོམ་གང་བ་མངའ་བ་འདི་རི་ལྟར་མི་གཡོ་ཞིང་བསམ་གཏན་མཛད་པའི་ཚེ། ཉི་མའི་དཀྱིལ་འཁོར་ཡོལ་ཏེ་སོང་ཡང་། ཤིང་གི་གྲིབ་མ་དེ་མ་ཡོལ་ཞིང་སྒྲིབ་པར་གནས་སོ།
en: The ministers responded, “Even though the orb of the sun has shifted, the shade of his tree does not leave Prince Siddhārtha—who has the highest and most sublime marks of virtue and is as brilliant as the sky—while he practices concentration, motionless as a mountain.”

source: དཔྱིད་འདས་དབྱར་གྱི་དུས་བབ་དབྱར་ཟླ་ར་བ་ལ།
en: In summer, the first month after spring,

source: །མེ་ཏོག་རྒྱས་ཤིང་མེ་ཏོག་ཡལ་གས་ཁེབས་གྱུར་ཏེ།
en: When flowers were covered in buds and blooming,

source: །ཁྲུང་ཁྲུང་རྨ་བྱ་ནེ་ཙོ་རི་སྐེགས་སྐད་འབྱིན་པ།
en: When cranes, peacocks, parrots, and myna birds were singing,

source: །ཤཱཀྱའི་བུ་དག་ཕལ་ཆེར་མངོན་དུ་འདོང་བར་གྱུར།
en: Most of the Śākya boys went outside.

source: །འདུན་པ་ཅན་གྱིས་སྨྲས་པ། གཞོན་ནུ་ནགས་ཚལ་དག་ནི་གཟིགས་པ་མཛད་སླད་དུ།
en: Chanda, surrounded by the other boys, said, “Young Prince, come on!

source: །བྱིས་པ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཏེ་གཤེགས་པའི་རིགས། །
en: Let’s go and take a look at the forest.

source: བྲམ་ཟེ་ལྟ་བུར་ཁྱིམ་ན་བཞུགས་པས་ཅི་ཞིག་བགྱི།
en: What use is staying in the house like a priest?

source: །བདག་ཅག་རྣམས་ནི་བུ་མོའི་ཚོགས་རྣམས་སྦྲོན་དུ་མཆི།
en: Come on, let’s go call on some girls.”

source: །ཉི་མའི་གུང་ལ་སེམས་ཅན་རྣམ་པར་དག་པ་དེ།
en: At midday, the Pristine Being, Unnoticed and without asking his parents,

source: །བྱིས་པ་ལྔ་བརྒྱ་དག་གིས་བསྐོར་ནས་ལྷན་ཅིག་ཏུ། །
en: Went out to a village Accompanied by five hundred attendants.

source: ཡབ་ལ་མ་གསོལ་ཡུམ་ལ་མ་གསོལ་མ་ཚོར་བར།
en: In that village, which belonged to the supreme king,

source: །དེ་ནི་བྱུང་ནས་ཞིང་པ་རྣམས་ཀྱི་གྲོང་དུ་སོང་།
en: There was a rose apple tree with many broad branches.

source: །རྒྱལ་པོ་དམ་པའི་ཞིང་པ་དག་གི་གྲོང་དེ་ན། །འཛམ་བུའི་སྡོང་ཆེན་ཡལ་ག་མང་པོ་རྒྱས་ཡོད་པ།
en: Seeing the tree, the prince was disturbed by the suffering he had just understood, And remarked,

source: །གཞོན་ནུས་མཐོང་ན་ཉམ་ཐག་སྡུག་བསྔལ་ཕོག་གྱུར་ཏེ།
en: “Conditioned things are no good!

source: །འདུས་བྱས་ཅི་རུང་སྡུག་བསྔལ་མང་ཞེས་སྙིང་རྗེ་བྱེད།
en: They bring a lot of suffering.”

source: །དུལ་བའི་སེམས་དང་ལྡན་པ་འཛམ་བུའི་གྲིབ་མར་སོང་།
en: With a disciplined mind, he approached the shade of the rose apple tree,

source: །རྩྭ་དག་བསྡུས་ཏེ་བདག་གིས་གདིང་བ་བཏིང་ནས་ནི།
en: Gathered some grass, and spread out a seat for himself.

source: །སྐྱིལ་མོ་ཀྲུང་འདུག་དྲང་པོར་ལུས་བསྲང་བསམ་གཏན་བཞི།
en: Then, sitting cross-legged and upright, the Bodhisattva practiced concentration,

source: །དགེ་བ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་བྱེད།
en: Immersed in the virtue of the four concentrations.

source: །དྲང་སྲོང་ལྔ་ཞིག་ནམ་མཁའི་དཀྱིལ་ནས་དོང་དོང་ན།
en: When five sages were coursing through the sky,

source: །འཛམ་བུའི་ཤིང་གི་སྟེང་དུ་ཕྱིན་ནས་འདོང་མ་ནུས།
en: They could not move beyond the top of the rose apple tree.

source: །དེ་དག་ཐོགས་ནས་ང་རྒྱལ་དྲེགས་པ་སྤང་བྱ་ཞིང་།
en: Thwarted, they relinquished pride and conceit,

source: །དེ་དག་ཐམས་ཅད་འཐུན་པར་ལྷན་ཅིག་ལྟ་བར་བྱེད།
en: And all of them were drawn to investigate.

source: །བདག་ཅག་རི་མཆོག་རི་རབ་དེ་བཞིན་འཁོར་ཡུག་དག ། ཐལ་ཕྱུང་ཐགས་ཐོགས་མེད་པར་ཤུགས་ཀྱིས་དོང་དོང་ན།
en: They thought, “We travel swiftly and without impediment, Penetrating the supreme Mount Meru, and likewise the surrounding ranges,

source: །བདག་ཅག་དེ་རིང་འཛམ་བུའི་ཤིང་ལྗོན་འདི་ལས་ནི།
en: Yet we are unable to pass beyond this rose apple tree.

source: །འདའ་བར་མ་ནུས་འདི་ལ་རྒྱུ་རྐྱེན་ཅི་ཞིག་ཡོད།
en: What could be the reason for this?”

source: །བབས་ཏེ་ས་སྟེང་འདུག་ནས་འཛམ་བུའི་ཤིང་དྲུང་ན། །ཤཱཀྱའི་བུ་ཕོ་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་ཅན། །འཛམ་གླིང་གསེར་གྱི་འོད་འཕྲོ་འདྲ་བ་འོད་ཟེར་ལྡན། །སྐྱིལ་མོ་ཀྲུང་བཅས་བསམ་གཏན་བྱེད་པ་དེ་ཚེ་མཐོང་།
en: They descended and settled on the ground, Where they saw the Bodhisattva, the Son of the Śākyas, As he sat cross-legged at the trunk of the rose apple tree, practicing concentration, Shining and brilliant like the glow of gold from the Jāmbū River.

source: །དེ་དག་རྨད་གྱུར་སྤྱི་བོར་སོར་བཅུ་ཐལ་སྦྱར་ཏེ། །ཐལ་མོ་སྦྱར་བ་རྐང་པར་གཏུགས་ནས་ཕྱག་འཚལ་ལོ།
en: Surprised, they joined their hands at their heads And paid homage, bowing down to his feet with palms joined.

source: །འགྲོ་བ་ཤིན་ཏུ་བདེ་མཛད་ལེགས་པར་བལྟམ་པ་ལེགས།
en: They said, “Holy One, Wellborn One, who brings happiness to the world!

source: །མྱུར་དུ་རྣམ་སངས་རྒྱས་ཏེ་བདུད་རྩིར་སེམས་ཅན་ཐུལ།
en: May you swiftly become awakened and lead beings to immortality!”

source: །སྡོང་པོ་མཆོག་ནི་པད་མ་འདྲ་བའི་སྤྱན་ལ་འདུད།
en: The supreme tree bowed down like a lotus leaf;

source: །གདུགས་ཡོལ་གྱུར་ཀྱང་གྲིབ་མས་བདེ་བར་གཤེགས་མི་གཏོང་།
en: Though the sun shifted, its shade did not leave the Well-Gone One.

source: །ལྷ་རྣམས་སྟོང་ཕྲག་མང་པོ་གནས་པ་ཐལ་སྦྱར་ནས།
en: Many thousands of gods, with palms joined,

source: །དེས་པར་བྱས་པ་དེ་ཡི་རྐང་པར་ཕྱག་ཀྱང་འཚལ།
en: Bowed down to the feet of this resolute child.

source: །ཟས་གཙང་རྒྱལ་པོ་བདག་གི་ཁྱིམ་ན་ཡོངས་ཚོལ་ཞིང་།
en: Śuddhodana, searching all around his quarters, asked,

source: །ངའི་བུ་གཞོན་ནུ་དེ་ནི་གང་དུ་སོང་ཞེས་རྨེད།
en: “Where has my son gone?”

source: །སྲུ་མོས་སྨྲས་པ་བདག་གིས་བཙལ་ཀྱང་མ་རྙེད་ན།
en: His maternal aunt said, “I have searched but did not find him;

source: །གཞོན་ནུ་དེ་ནི་གར་བཞུད་རྒྱལ་པོས་རྨ་བར་གསོལ།
en: Your Majesty, please find out where the boy has gone.”

source: །ཟས་གཙང་རྒྱལ་པོས་ཉུང་རུམ་དག་ལ་རིངས་པར་རྨས། །ང་ཡི་གཞོན་ནུ་འདི་ནས་བྱུང་བར་ལ་ལས་མཐོང་ངམ་ཞེས། །སྒོ་བ་རྣམས་དང་དེ་བཞིན་ནང་མི་ཀུན་ལའང་རྨས།
en: Śuddhodana frantically asked his attendants, The doormen, and everyone else in the inner quarters, “Has anyone seen my son go out?”

source: །ལྷ་ཅིག་ཁྱོད་གསོན་མཆོག་དེ་ཞིང་པའི་གྲོང་དུ་བཞུད། །དེ་ནི་རིངས་པར་ཤཱཀྱ་རྣམས་དང་ལྷན་ཅིག་ཏུ།
en: Then someone said, “Your Majesty! The Supreme One has gone to a farming village.”

source: །བྱུང་ནས་དཔལ་ཞུགས་གྱུར་པའི་ཞིང་པའི་གྲོང་དུ་བལྟས། །ཇི་ལྟར་ཉི་མ་བྱེ་བ་ཁྲག་ཁྲིག་ཤར་བ་ལྟར། །དེ་ལྟར་དཔལ་གྱིས་འབར་ཞིང་ཕན་བྱེད་འདུག་པ་མཐོང་།
en: The king hurriedly left together with his companions And saw the prince sitting on a hill by the farming village, Benefiting others and blazing with splendor, Like a trillion rising suns.

source: །ཅོད་པན་རལ་གྲི་ལྷམ་དག་ཕ་ཟད་ཕོག་ཕུད་དེ།
en: Taking off his crown, sword, and shoes,

source: །མགོ་བོར་སོར་བཅུ་ཐལ་མོ་སྦྱར་ནས་ཕྱག་ཀྱང་འཚལ།
en: The king made salutations to the prince with his palms joined above his head.

source: །དྲང་སྲོང་བདག་ཉིད་ཆེན་པོ་ལེགས་པར་ཡང་དག་སྨྲ།
en: The king said, “Yes! The eminent sages speak eloquently and truthfully;

source: །གཞོན་ནུ་བྱང་ཆུབ་དོན་དུ་མངོན་པར་འབྱུང་དུ་ངེས།
en: The boy will surely leave home for the sake of awakening.”

source: །རབ་ཏུ་དད་ལྷ་བརྒྱ་ཕྲག་བཅུ་གཉིས་ཚང་བ་དང་། །དེ་བཞིན་ཤཱཀྱ་ལྔ་བརྒྱ་ཉེ་བར་འོངས་པ་དང་། །བདེ་གཤེགས་ཡོན་ཏན་རྒྱ་མཚོ་ལྡན་པའི་རྫུ་འཕྲུལ་མཐོང་།
en: Twelve hundred gods with supreme devotion, As well as five hundred Śākya boys, approached. Seeing the miraculous power of the Well-Gone One with his ocean of qualities,

source: །བསམ་པ་བརྟན་པས་རྫོགས་པའི་བྱང་ཆུབ་སེམས་ཀྱང་སྐྱེད།
en: They firmly engendered the intent set on supreme awakening.

source: །དེས་ནི་སྟོང་གསུམ་མ་ལུས་ས་རྣམས་རབ་བསྐྱོད་ནས།
en: Shaking the ground of the entire trichiliocosm,

source: །དྲན་དང་ཤེས་བཞིན་ཏིང་ངེ་འཛིན་ལས་ལངས་གྱུར་ཏེ།
en: The Bodhisattva arose from his absorption with mindfulness and introspection.

source: །མདོག་བཟང་ལྡན་པས་ཡབ་ལ་ཚངས་པའི་ཚིག་བརྗོད་པ།
en: The Resplendent One then said to his father in the voice of Brahmā,

source: །ཡབ་ཅིག་ཞིང་བླས་ཐོང་ལ་གཞན་ལས་ཚོལ་མ་མཛད།
en: “O Father, relinquish your fields and seek no further!

source: །གལ་ཏེ་གསེར་ཞིག་འཚལ་ནའང་བདག་གིས་གསེར་ཆར་དབབ།
en: “If it’s gold that you seek, I will shower down a rain of gold;

source: །དེ་སྟེ་ན་བཟའ་འཚལ་ནའང་བདག་གིས་ན་བཟའ་དབུལ།
en: If it’s garments that you seek, I will offer you garments;

source: །འོན་ཏེ་འབྲུ་ཞིག་འཚལ་ནའང་བདག་གིས་འབྲུ་ཆར་དབབ།
en: If it’s grain that you seek, I will shower down a rain of grain.

source: །མི་དབང་ཁྱོད་ཀྱིས་འགྲོ་བ་ཀུན་ལ་ཡང་དག་སྦྱོར།
en: Your Majesty, please apply this genuinely to everyone!”

source: །ཡབ་དང་དེ་བཞིན་སྐྱེ་བོ་འཁོར་ལ་བསྟན་བྱས་ནས།
en: Once he had instructed his father and those in the retinue,

source: །སྐད་ཅིག་དེ་ལ་དེ་སླར་གྲོང་ཁྱེར་མཆོག་ཏུ་ཞུགས།
en: He instantly returned to the supreme city.

source: །འགྲོ་དང་འཐུན་པ་ཙམ་དུ་གྲོང་ཁྱེར་དེར་གནས་ཀྱི།
en: In conformity with worldly convention, he dwelt in that city,

source: །སེམས་ཅན་རྣམ་དག་མངོན་པར་འབྱུང་བའི་ཡིད་དང་ལྡན།
en: Yet the Pristine Being had fixed his mind on renouncing the palace.

source: །ཞིང་བའི་གྲོང་གི་ལེའུ་སྟེ་བཅུ་གཅིག་པའོ།། །།
en: This concludes the eleventh chapter, on the farming village.

source: དགེ་སློང་དག་དེ་ལྟར་གཞོན་ནུ་དེ་དེ་བས་ཀྱང་ཡ་ཟད་སྐྱེས་པ་དང་། དུས་གཞན་ཞིག་ན་རྒྱལ་པོ་ཟས་གཙང་མ་ཤཱཀྱའི་ཚོགས་དང་ལྷན་ཅིག་ཏུ་འདུན་ས་ན་འདུག་འདུག་པ་དེའི་ཚེ།
en: Monks, one time, when the prince had grown older, King Śuddhodana was sitting in the meeting hall together with the assembly of Śākyas.

source: ཤཱཀྱ་རྒན་རབས་རྒན་རབས་ཁ་ཅིག་གིས་རྒྱལ་པོ་ཟས་གཙང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ།
en: There some of the Śākya elders spoke to King Śuddhodana:

source: གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་འདི་ནི་བྲམ་ཟེ་ལྟས་མཁན་རྣམས་དང་། བློ་ངེས་པ་དང་ལྡན་པའི་ལྷ་མང་པོས་འདི་སྐད་དུ་བསྟན་ཏེ། གཞོན་ནུ་འདི་གལ་ཏེ་མངོན་པར་བྱུང་བར་གྱུར་ན་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་རོ། །
en: “Your Majesty, you know that the priests who are skilled in making predictions, as well as the gods who have definite knowledge, have foretold that if Prince Sarvārthasiddha renounces the household, he will become a thus-gone one, a worthy one, a completely perfect buddha.
